src/main/resources/xml/accommodationSalesServicePort/searchResortReservationsByGuest/searchResortReservationsByGuest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sal="http://sales.accommodation.transferobject.booking.dreams.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <sal:searchResortReservationsByGuest>
         <!--Optional:-->
         <searchResortReservationsRequest>
            <!--Optional:-->
            <agencyIataNumber>?</agencyIataNumber>
            <!--Optional:-->
            <guestLastName>?</guestLastName>
            <!--Optional:-->
            <reservationNumber>?</reservationNumber>
            <!--Optional:-->
            <postalCode>?</postalCode>
            <!--Optional:-->
            <guestFirstName>?</guestFirstName>
            <!--Optional:-->
            <arrivalDate>?</arrivalDate>
            <!--Optional:-->
            <resortCode>?</resortCode>
         </searchResortReservationsRequest>
         <!--Optional:-->
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </sal:searchResortReservationsByGuest>
   </soapenv:Body>
</soapenv:Envelope>
